### Задание 1.
Написать программу, которая будет находить сумму любых двух целых чисел, введенных с клавиатуры.
***
### Задание 2.
Написать программу деления одного целого числа на другое.
***
### Задание 3.
Изменить тип переменных в предыдущей программе на double (стандартный вещественный тип). В функциях scanf() и printf() поменять спецификаторы формата на %lf. Входные и выходные данные те же, что и в задании 2, обозначения переменных те же, тип всех переменных double.
***
### Задание 4.
В предыдущей программе изменить тип делимого и делителя обратно на int, результат оставить типа double.
***
### Задание 5.
Проанализировать ошибки при вызове функций scanf() и printf().
***
### Задание 6.
Познакомьтесь с типами данных char и unsigned char.
***
### Задание 7.
Познакомьтесь с типами данных int, short int, long int и unsigned int.
***
### Задание 8.
Познакомьтесь с типами данных float и double.
***
### Задание 9.
Проверить порядок выполнения операций в каждом выражении, содержащем несколько операций присваивания, разделив каждый оператор-выражение на несколько операторов, выполняемых последовательно.
***
### Задание 10.
Написать программу для вычисления значений следующих выражений: a=5, c=5
a=a+b-2
c=c+1, d=c-a+d
a=a*c, c=c-1
a=a/10, c=c/2, b=b-1, d=d*(c+b+a)
Выражения, записанные в одной строке, записывать одним оператором-выражением, не содержащим запятой. Использовать расширенные операции присваивания, операции инкремента и декремента. Переменные c и d объявить как целые, переменные a и b – как вещественные. Значения переменных b и d вводить с клавиатуры. После вычисления каждого выражения выводить на экран значения всех переменных.